import Image from "next/image";

import { useMemo, useState, useRef } from "react";

import MapWithClusters from "@modules/common/components/map/mapWithClusters";
import ButtonWithIcon from "@modules/common/components/button/buttonWithIcon";
import OutsideAlerter from "hooks/useOutsideAlerter";

import mapIcon from "public/icons/map-icon.svg";
import mapIconWhite from "public/icons/map-icon-white.svg";
import { Dialog } from "@headlessui/react";
import DialogWrapper from "@modules/common/components/dialog/dialogWrapper";
import DialogCloseIcon from "@modules/common/components/dialog/dialogCloseIcon";
import DialogTitle from "@modules/common/components/dialog/dialogTitle";

export default function ProductsShowOnMap({ products, className, ...other }) {
    const [isShowMap, setIsShowMap] = useState(false);

    const mapImageSrc = useRef(mapIcon.src);

    // const addresses = useMemo(
    //   () => products.map((p) => p.properties.product_address),
    //   [products]
    // );

    const buttonHoverHandler = (event) => {
        if (event?.type === "mouseleave") {
            mapImageSrc.current = mapIcon.src;
        } else {
            mapImageSrc.current = mapIconWhite.src;
        }
    };

    return (
        <>
            {products && products.length > 0 && (
                <>
                    {/* <OutsideAlerter action={() => setIsShowMap(false)}> */}
                    <div className="relative">
                        <ButtonWithIcon
                            onClick={() => setIsShowMap((val) => !val)}
                            onMouseOver={buttonHoverHandler}
                            onMouseLeave={buttonHoverHandler}
                            icon={
                                <Image
                                    src={mapImageSrc.current}
                                    height={mapIcon.height}
                                    width={mapIcon.width}
                                />
                            }
                            className={
                                className
                                    ? className
                                    : "px-[20px] py-[10px] w-auto whitespace-nowrap"
                            }
                            {...other}
                        >
                            На карте
                        </ButtonWithIcon>

                        {/* {addresses && isShowMap && (
          <div className="absolute z-20 top-[40px] right-[0px] w-[420px] shadow-lg bg-white">
            <MapWithClusters
              className={"w-full h-[300px]"}
              zoom={10}
              city={"Сочи"}
              addresses={addresses}
            />
          </div>
        )} */}
                    </div>
                    {/* </OutsideAlerter> */}

                    <Dialog
                        open={isShowMap}
                        onClose={() => setIsShowMap(false)}
                    >
                        <DialogWrapper isShow={isShowMap}>
                            <Dialog.Panel className="bg-white p-5 w-full lg:w-2/3 h-[600px] rounded-[10px] relative">
                                <DialogTitle className="text-center">
                                    Объекты на карте
                                </DialogTitle>

                                {products && (
                                    <MapWithClusters
                                        className={
                                            "w-full h-[470px] rounded-md overflow-hidden"
                                        }
                                        zoom={10}
                                        city={"Сочи"}
                                        products={products}
                                    />
                                )}

                                <DialogCloseIcon
                                    className={"absolute right-0 top-0 m-2.5"}
                                    onClick={() => setIsShowMap(false)}
                                />
                            </Dialog.Panel>
                        </DialogWrapper>
                    </Dialog>
                </>
            )}
        </>
    );
}

export function Icon() {
    return (
        <svg
            width="14"
            height="15"
            viewBox="0 0 14 15"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
        >
            <g clipPath="url(#clip0_2826_5003)">
                <path
                    d="M13.7677 13.638C13.7071 13.638 13.6475 13.6142 13.6029 13.5697L9.22842 9.19512C9.18201 9.14885 9.15734 9.08525 9.16041 9.01977C9.16335 8.9543 9.19362 8.89323 9.24389 8.85136L13.6185 5.20578C13.6881 5.14777 13.7853 5.13577 13.8665 5.17364C13.9484 5.21204 14.0008 5.29432 14.0008 5.38473V13.4049C14.0008 13.499 13.9441 13.5841 13.8569 13.6201C13.8281 13.6321 13.7977 13.638 13.7677 13.638ZM9.73847 9.04604L13.5346 12.8423V5.88238L9.73847 9.04604Z"
                    fill="#0E65E5"
                />
                <path
                    d="M11.0105 14.3897H3.24089C3.14275 14.3897 3.05514 14.3283 3.02181 14.236C2.98834 14.1436 3.0162 14.0405 3.09155 13.9776L7.32959 10.446C7.42266 10.3689 7.55854 10.3752 7.64362 10.4603L11.1752 13.9918C11.2419 14.0585 11.2619 14.1587 11.2257 14.2457C11.1897 14.3329 11.1046 14.3897 11.0105 14.3897ZM3.88456 13.9236H10.4479L7.46453 10.9403L3.88456 13.9236Z"
                    fill="#0E65E5"
                />
                <path
                    d="M13.7662 4.13184H10.2575L7.11327 6.75211L5.19934 8.34694L0.232422 12.4862V14.157H3.23993L7.47784 10.6254L11.0094 14.157H13.7662V13.4051L9.39164 9.03048L13.7662 5.38503V4.13184Z"
                    fill="white"
                />
                <path
                    d="M13.7669 14.3898H11.0101C10.9482 14.3898 10.889 14.3651 10.8453 14.3214L7.46411 10.9404L3.38982 14.3357C3.34781 14.3706 3.29514 14.3898 3.24047 14.3898H0.233091C0.104278 14.3898 0 14.2854 0 14.1567V12.4857C0 12.4165 0.0306699 12.351 0.083742 12.3068L10.1088 3.95258C10.1507 3.91751 10.2035 3.89844 10.258 3.89844H13.7669C13.8957 3.89844 14 4.00285 14 4.13153V5.38472C14 5.45393 13.9692 5.51941 13.9161 5.56368L9.73754 9.0459L13.9316 13.2399C13.9753 13.2837 13.9999 13.343 13.9999 13.4048V14.1567C14 14.2854 13.8957 14.3898 13.7669 14.3898ZM11.1065 13.9236H13.5338V13.5013L9.22762 9.19499C9.18122 9.14872 9.15655 9.08511 9.15962 9.01964C9.16255 8.95416 9.19282 8.89309 9.24309 8.85122L13.5338 5.27551V4.36449H10.3425L0.466048 12.5949V13.9236H3.15606L7.32916 10.4462C7.42224 10.369 7.55812 10.3752 7.64333 10.4603L11.1065 13.9236Z"
                    fill="#0E65E5"
                />
                <path
                    d="M0.233091 12.7188C0.199354 12.7188 0.165751 12.7115 0.134281 12.6968C0.0524054 12.6585 0 12.5763 0 12.4857V4.13153C0 4.00285 0.104277 3.89844 0.233091 3.89844H10.2581C10.3563 3.89844 10.4439 3.95991 10.4774 4.05219C10.5107 4.14446 10.4828 4.24767 10.4075 4.31048L0.382306 12.6648C0.339502 12.7004 0.286563 12.7188 0.233091 12.7188ZM0.466048 4.36449V11.9882L9.61446 4.36449H0.466048Z"
                    fill="#0E65E5"
                />
                <path
                    d="M7.00093 3.75583C7.00093 5.3476 4.11863 7.8912 4.11863 7.8912C4.11863 7.8912 1.23633 5.3476 1.23633 3.75583C1.23633 2.16407 2.52686 0.873535 4.11863 0.873535C5.71053 0.873535 7.00093 2.16394 7.00093 3.75583Z"
                    fill="#5C9EFF"
                />
                <path
                    d="M4.11721 8.12433C4.06214 8.12433 4.00707 8.10487 3.96293 8.06606C3.84211 7.95925 1.00195 5.43352 1.00195 3.75588C1.00195 2.0381 2.39943 0.640625 4.11721 0.640625C5.83499 0.640625 7.2326 2.0381 7.2326 3.75588C7.2326 5.43366 4.39244 7.95925 4.27149 8.06606C4.22735 8.10487 4.17228 8.12433 4.11721 8.12433ZM4.11721 1.10667C2.65639 1.10667 1.468 2.29506 1.468 3.75588C1.468 4.9008 3.25445 6.783 4.11721 7.57734C4.97997 6.783 6.76655 4.90093 6.76655 3.75588C6.76655 2.29506 5.57816 1.10667 4.11721 1.10667Z"
                    fill="#0E65E5"
                />
                <path
                    d="M5.71844 3.75571C5.71844 4.63953 5.00197 5.35614 4.11801 5.35614C3.23405 5.35614 2.51758 4.63953 2.51758 3.75571C2.51758 2.87175 3.23405 2.15527 4.11801 2.15527C5.00197 2.15527 5.71844 2.87175 5.71844 3.75571Z"
                    fill="white"
                />
                <path
                    d="M4.11686 5.58928C3.10582 5.58928 2.2832 4.76679 2.2832 3.75589C2.2832 2.74485 3.10569 1.92236 4.11686 1.92236C5.12776 1.92236 5.95025 2.74485 5.95025 3.75589C5.95025 4.76679 5.12776 5.58928 4.11686 5.58928ZM4.11686 2.38854C3.36292 2.38854 2.74938 3.00194 2.74938 3.75589C2.74938 4.50996 3.36292 5.12323 4.11686 5.12323C4.87094 5.12323 5.4842 4.50996 5.4842 3.75589C5.4842 3.00194 4.87094 2.38854 4.11686 2.38854Z"
                    fill="#0E65E5"
                />
                <path
                    d="M1.63086 13.2243L3.26223 11.8262L1.63086 13.2243Z"
                    fill="#5C9EFF"
                />
                <path
                    d="M1.63144 13.4574C1.56596 13.4574 1.50062 13.4297 1.45462 13.3761C1.37074 13.2784 1.38208 13.1313 1.47996 13.0475L3.11119 11.6493C3.20893 11.5656 3.35615 11.577 3.43963 11.6745C3.52363 11.7722 3.5123 11.9194 3.41442 12.0032L1.78305 13.4014C1.73905 13.439 1.68518 13.4574 1.63144 13.4574Z"
                    fill="#0E65E5"
                />
                <path
                    d="M4.19531 11.1273L5.82668 9.729L4.19531 11.1273Z"
                    fill="#5C9EFF"
                />
                <path
                    d="M4.19394 11.3603C4.12846 11.3603 4.06312 11.3327 4.01712 11.2789C3.93324 11.1812 3.94458 11.0341 4.04246 10.9503L5.67369 9.55207C5.77143 9.46859 5.91838 9.47966 6.00213 9.5774C6.08613 9.67515 6.0748 9.82223 5.97679 9.90597L4.34555 11.3042C4.30155 11.3419 4.24768 11.3603 4.19394 11.3603Z"
                    fill="#0E65E5"
                />
                <path
                    d="M6.99219 8.79702L8.39047 7.63184L6.99219 8.79702Z"
                    fill="#5C9EFF"
                />
                <path
                    d="M6.99121 9.02971C6.92427 9.02971 6.858 9.00118 6.81186 8.94584C6.72945 8.84703 6.74279 8.70008 6.8416 8.61767L8.23987 7.45248C8.33935 7.36994 8.4859 7.38354 8.56831 7.48235C8.65072 7.58116 8.63725 7.72811 8.53844 7.81052L7.14029 8.97571C7.09642 9.01198 7.04375 9.02971 6.99121 9.02971Z"
                    fill="#0E65E5"
                />
                <path
                    d="M9.55469 6.69937L10.9528 5.53418L9.55469 6.69937Z"
                    fill="#5C9EFF"
                />
                <path
                    d="M9.55553 6.93252C9.48872 6.93252 9.42245 6.90399 9.37631 6.84878C9.2939 6.74984 9.30724 6.60289 9.40605 6.52061L10.8043 5.35543C10.9038 5.27275 11.0504 5.28635 11.1328 5.38516C11.2152 5.48411 11.2017 5.63105 11.1029 5.71333L9.70461 6.87852C9.66087 6.91479 9.6082 6.93252 9.55553 6.93252Z"
                    fill="#0E65E5"
                />
                <path
                    d="M11.8848 4.83537L12.8169 4.13623L11.8848 4.83537Z"
                    fill="#5C9EFF"
                />
                <path
                    d="M11.8857 5.06814C11.8146 5.06814 11.7448 5.036 11.699 4.97493C11.6217 4.87198 11.6426 4.72597 11.7457 4.64876L12.6779 3.94962C12.7807 3.87215 12.9266 3.89308 13.0041 3.99616C13.0814 4.0991 13.0605 4.24525 12.9574 4.32246L12.0252 5.02147C11.9833 5.05307 11.9344 5.06814 11.8857 5.06814Z"
                    fill="#0E65E5"
                />
            </g>
            <defs>
                <clipPath id="clip0_2826_5003">
                    <rect
                        width="14"
                        height="14"
                        fill="white"
                        transform="translate(0 0.5)"
                    />
                </clipPath>
            </defs>
        </svg>
    );
}
